Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawPolyLine Method
 Draw a temporary polyline into all open Tekla Structures views.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int DrawPolyLine(
	GraphicPolyLine GraphicPolyLine
)
Public Function DrawPolyLine (
	GraphicPolyLine As GraphicPolyLine
) As Integer
Parameters
GraphicPolyLine
Type: Tekla.Structures.Model.UI.GraphicPolyLine
The polyline to draw.
Return Value
Type: Int32
The identifier of the temporary graphic. You can delete the graphic with RemoveTemporaryGraphicsObject.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace